## Data Frames in Pandas

In [21]:
import pandas as pd

In [22]:
data = [
    {"Name": "Nouman",     "Age": 27, "Department": "IT",        "Salary": 78000},
    {"Name": "Ahsan",    "Age": 31, "Department": "HR",        "Salary": 62000},
    {"Name": "Tariq",   "Age": 29, "Department": "Finance",   "Salary": 88000},
    {"Name": "Ayesha",  "Age": 35, "Department": "Marketing", "Salary": 73000},
    {"Name": "Sara",   "Age": 26, "Department": "Sales",     "Salary": 50000},
    {"Name": "Hira",    "Age": 33, "Department": "IT",        "Salary": 81000}
]

### Creating a Dataframe

In [23]:
df = pd.DataFrame(data)
df

     Name  Age Department  Salary
0  Nouman   27         IT   78000
1   Ahsan   31         HR   62000
2   Tariq   29    Finance   88000
3  Ayesha   35  Marketing   73000
4    Sara   26      Sales   50000
5    Hira   33         IT   81000

### Operations on data frame

In [24]:
df.head(3)

     Name  Age Department  Salary
0  Nouman   27         IT   78000
1   Ahsan   31         HR   62000
2   Tariq   29    Finance   88000

In [25]:
df.tail(2)

   Name  Age Department  Salary
4  Sara   26      Sales   50000
5  Hira   33         IT   81000

In [26]:
df.shape  # rows and columns

(6, 4)

In [27]:
df.info()  # information about data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   Department  6 non-null      object
 3   Salary      6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [28]:
df.describe()   # Statistical Information

             Age        Salary
count   6.000000      6.000000
mean   30.166667  72000.000000
std     3.488075  13841.965178
min    26.000000  50000.000000
25%    27.500000  64750.000000
50%    30.000000  75500.000000
75%    32.500000  80250.000000
max    35.000000  88000.000000

### Loc and iloc Functions

In [29]:
df.iloc[1:3]

    Name  Age Department  Salary
1  Ahsan   31         HR   62000
2  Tariq   29    Finance   88000

In [30]:
df.iloc[1:4, :3]

     Name  Age Department
1   Ahsan   31         HR
2   Tariq   29    Finance
3  Ayesha   35  Marketing

In [31]:
df.loc[1:4, ["Age", "Salary"]]

   Age  Salary
1   31   62000
2   29   88000
3   35   73000
4   26   50000

### Printing and Deleting a Specific Column

In [32]:
df["Salary"]

0    78000
1    62000
2    88000
3    73000
4    50000
5    81000
Name: Salary, dtype: int64

In [33]:
df.drop("Age", axis=1)
# df.drop("Age", axis=1, inplace=True)

     Name Department  Salary
0  Nouman         IT   78000
1   Ahsan         HR   62000
2   Tariq    Finance   88000
3  Ayesha  Marketing   73000
4    Sara      Sales   50000
5    Hira         IT   81000

### Broadcasting

In [34]:
df["Salary"] = df["Salary"] +5000
df

     Name  Age Department  Salary
0  Nouman   27         IT   83000
1   Ahsan   31         HR   67000
2   Tariq   29    Finance   93000
3  Ayesha   35  Marketing   78000
4    Sara   26      Sales   55000
5    Hira   33         IT   86000

### Renaming Columns

In [35]:
df.rename(columns={"Department": "Dept"}, inplace=True)
df

     Name  Age       Dept  Salary
0  Nouman   27         IT   83000
1   Ahsan   31         HR   67000
2   Tariq   29    Finance   93000
3  Ayesha   35  Marketing   78000
4    Sara   26      Sales   55000
5    Hira   33         IT   86000

### Unqiue Values and Value Counts

In [36]:
df["Dept"].unique()

array(['IT', 'HR', 'Finance', 'Marketing', 'Sales'], dtype=object)

In [37]:
df["Dept"].value_counts()

Dept
IT           2
HR           1
Finance      1
Marketing    1
Sales        1
Name: count, dtype: int64

### Addding another column

In [38]:
df["New Salary"] =df["Salary"] * 5
df

     Name  Age       Dept  Salary  New Salary
0  Nouman   27         IT   83000      415000
1   Ahsan   31         HR   67000      335000
2   Tariq   29    Finance   93000      465000
3  Ayesha   35  Marketing   78000      390000
4    Sara   26      Sales   55000      275000
5    Hira   33         IT   86000      430000